Tekla Open API Reference for Tekla Structures 2025
AnalysisConnectivity.CombinedTypeEnum Enumeration
 The combined types.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum CombinedTypeEnum
Public Enumeration CombinedTypeEnum
Members
Member name | Value | Description
COMBINED_TYPE_FIXED | 0 |  The combined type is fixed.
COMBINED_TYPE_PINNED | 1 |  The combined type is pinned.
COMBINED_TYPE_OTHER | 2 |  The combined type is other.
See Also
Reference
Tekla.Structures.Analysis Namespace